<?php
/*1. Дан массив с элементами 'html', 'css', 'php', 'js', 'jq'. С помощью цикла foreach выведите эти слова в столбик.*/
//
//$arr=[];
//$arr[]='html';
//$arr[]='css';
//$arr[]='php';
//$arr[]='js';
//$arr[]='jq';
//foreach($arr as $value){
//  echo $value.'<br>';
//};
//--------------------------------------------------------------------------------------------------------------------------

/*2. Дан массив с элементами 1, 20, 15, 17, 24, 35. С помощью цикла foreach найдите сумму элементов этого массива. Запишите ее в переменную $result.*/

//$arr=[];
//$arr[]=1;
//$arr[]=20;
//$arr[]=15;
//$arr[]=17;
//$arr[]=24;
//$arr[]=35;
////
//$result=0;
//foreach ($arr as $key=>$value){
//
//$result += $value;
//
//    };
//
//echo $result;
//
//echo"<br>";
////echo array_sum($arr);

//---------------------------------------------------------------------------------------------------------------------------


/*3. Дан массив с элементами 26, 17, 136, 12, 79, 15. С помощью цикла foreach найдите сумму квадратов элементов этого массива. Результат запишите переменную $result.*/

//$mass=array(26,17,136,12,79,15);
//
//$result=0;
//foreach($mass as $value){$result+=$value**2;};
//echo $result;

//-------------------------------------------------------------------------------------------------------------------------------

/*4. Дан массив $arr. С помощью первого цикла foreach выведите на экран столбец ключей, с помощью второго — столбец элементов.

$arr = array('green'=>'зеленый', 'red'=>'красный','blue'=>'голубой');*/
//
//$arr = array('green'=>'зеленый', 'red'=>'красный','blue'=>'голубой');
//foreach ($arr as $key=>$value){echo $key."<br>";};
//echo '<div style="position:absolute; top:7px; left:80px;">';
//foreach ($arr as $key=>$value){echo  '|     '.$value."<br>";};
//echo '</div>';

//-------------------------------------------------------------------------------------------------------------------------------

/*5. Дан массив $arr с ключами 'Коля', 'Вася', 'Петя' с элементами '200', '300', '400'. С помощью цикла foreach выведите на экран столбец строк такого формата: 'Коля — зарплата 200 долларов.'.*/

//$arr = array ('Коля'=>'200','Вася'=>'300','Петя'=>'400');
//
//foreach ($arr as $key=>$value){echo $key." -зарплата ".$value.' долларов;'."<br>";};

//-----------------------------------------------------------------------------------------------------------------------------

/*6. Дан массив $arr. С помощью цикла foreach запишите английские названия в массив $en, а русские — в массив $ru.

$arr = array('green'=>'зеленый', 'red'=>'красный','blue'=>'голубой');*/
//
//$arr = array('green'=>'зеленый', 'red'=>'красный','blue'=>'голубой');
//$en=[];
//$ru=[];
//foreach ($arr as $key=>$value){
//  $en[]=$key;
//    $ru[]=$value;
//};
//print_r($arr);
//echo"<br>";
//print_r($en);
//echo"<br>";
//print_r($ru);

//-------------------------------------------------------------------------------------------------------------------------------

/*7. Дан массив с элементами 2, 5, 9, 15, 0, 4. С помощью цикла foreach и оператора if выведите на экран столбец тех элементов массива, значения которых больше 3-х, но меньше 10.*/
//
//$arr = array (2,5,9,15,0,4);
//foreach ($arr as $key=>$value){
//if ($value>3 && $value<10 ){echo $value."<br>";};
//    };

//-------------------------------------------------------------------------------------------------------------------------------


/*8. Дан массив с элементами 1, 2, 3, 4, 5, 6, 7, 8, 9. С помощью цикла foreach создайте строку '-1-2-3-4-5-6-7-8-9-'.*/

// Исравленно.

//$arr= array(1, 2, 3, 4, 5, 6, 7, 8, 9);
//var_dump($arr);
//foreach ($arr as $value){
////$a ='-'."$value";
//    echo "$value-";
//};

//
////Как создать форычём с дополнительным минусом в конеце не понятно !!! Но понимание пришло)))))
////$result=implode('-',$arr);
////echo "-".$result."-";

//-------------------------------------------------------------------------------------------------------------------------------

/*9.Выведите столбец чисел от 1 до 100.*/

//for($i=1;$i<=100;$i++)
//{echo $i."<br>";};

//------------------------------------------------------------------------------------------------------------------------------

/*10. Выведите столбец чисел от 11 до 33.*/

//for($i=11;$i<=33;$i++)
//{echo $i."<br>";};

//----------------------------------------------------------------------------------------------------------------------------

/*11. Выведите столбец четных чисел в промежутке от нуля до 100.*/

//for ($i=0;$i<=100;$i++){
//    if($i%2 != true){echo $i."<br>";};
//};
//-------------------------------------------------------------------------------------------------------------------------------

/*12. Дано число $n = 1000. Делите его на 2 столько раз, пока результат деления не станет меньше 50. Какое число получится? Посчитайте количество итераций, необходимых для этого (итерации — это количество проходов цикла), и запишите его в переменную $num.*/

// поправленно


//$num='';
//$n=1000;
//for ($n=1000;$n>=50;$num++){
//    $n=$n/2;
//
//};
//
//echo  'num = '."$num"."<br>";
//echo   'n = '."$n"."<br>";

//----------------------------------------------------------------------------------------------------------------------------


/*
13. Дан массив с элементами 4, 2, 5, 19, 13, 0, 10. С помощью цикла foreach и оператора if выведите на экран столбец тех элементов массива, которые больше 3-х, но меньше 10.*/
//
//$arr=array (4, 2, 5, 19, 13, 0, 10);
//
//
//foreach($arr as $value){
//  if ($value>3 && $value<10){
//    echo $value."<br>";
//  };
//};

//-------------------------------------------------------------------------------------------------------------------------


/*
14. Дан массив с элементами 4, 2, 5, 19, 13, 0, 10. С помощью цикла foreach и оператора if проверьте есть ли в массиве элемент со значением $e, равном 2, 3 или 4. Если есть — выведите на экран 'Есть!', иначе выведите 'Нет!'.*/
//
#$arr = array(4, 2, 5, 19, 13, 0, 10);
#$rez=false;
#foreach ($arr as $e) {
#if ($e>=2 || $e<=4){
#$rez= true;
#};
# };
#echo ($rez)?'Есть':'Нет';

//-------------------------------------------------------------------------------------------------------------------------------

/*
15. Дан массив $arr. С помощью цикла foreach и переменной $count подсчитайте количество элементов этого массива. Проверьте работу скрипта на примере массива с элементами 4, 2, 5, 19, 13, 0, 10.*/

// Исправленно
//
//$arr = array (4, 2, 5, 19, 13, 0, 10);
//$count=0;
//foreach ($arr as $i){
//$count++;
//};
//echo $count;
//echo "<br>";
//echo 'Это если тандартной йенкцией проверить'.count($arr);

//------------------------------------------------------------------------------------------------------------------------------

/*
16. Дан массив с элементами 1, 2, 3, 4, 5, 6, 7, 8, 9. С помощью цикла foreach и оператора if выведите на экран столбец элементов массива, как показано на картинке.
1, 2, 3
4, 5, 6
7, 8, 9
*/
//Исправленно
// Если бы не списал никогда бы не догадался что !=%3 так выдаёт.!!

//$arr = array (1, 2, 3, 4, 5, 6, 7, 8, 9);
//
//foreach ($arr as $key => $value)
//{echo (($key+1)%3!=0) ? $value.", " : $value."<br/>";}
//

//
// //!!!!!!
//-------------------------------------------------------------------------------------------------------------------

/*17. Составьте массив месяцев. С помощью цикла foreach выведите все месяцы, а текущий месяц выведите жирным. Текущий месяц должен храниться в переменной $month.*/
//
//$arr = array('Январь','Февраль','Март','Апрель','Май','Июнь','Июль','Август','Сентябрь','Октябрь','Ноябрь','Декабрь');
//$month='Февраль';
//
//foreach($arr as $key=>$value)
//{
//if ( $value == $month){ echo "<b>".$value."</b>"."<br>";}
//    else {echo $value."<br>" ;};
//};

//-------------------------------------------------------------------------------------------------------------------------------


/*18. Составьте массив дней недели. С помощью цикла foreach выведите все дни недели, а текущий день выведите курсивом. Текущий день должен храниться в переменной $day.*/
//
//$arr=array('Понедельник','Вторник','Среда','Четверг','Пятница','Суббота','Воскресенье');
//$day='Суббота';
//foreach ($arr as $value){
//  if ($value == $day){echo "<i>".$value."</i>"."<br>";}
//    else{echo $value."<br>";};
//};

//-----------------------------------------------------------------------------------------------------------------------------

/*
19. Нарисуйте пирамиду, как показано на рисунке, только у вашей пирамиды должно быть 20 рядов, а не 5.
x
xx
xxx
xxxx
xxxxx
*/

//for($i=1;$i<=20;$i++){
//  for($y=0;$y<$i;$y++){
//  echo 'x';
//  };
//    echo "<br>";
//};
//-------------------------------------------------------------------------------------------------------------------------------

/*
20. Нарисуйте пирамиду, как показано на рисунке, только у вашей пирамиды должно быть 9 рядов, а не 5.
1
22
333
4444
55555*/
//
//for($i=1;$i<10;$i++){
//    for($y=0;$y<$i;$y++){
//        echo $i;
//    };
//    echo "<br>";
//};

//-------------------------------------------------------------------------------------------------------------------------------

/*
21. Нарисуйте пирамиду, как показано на рисунке, воспользовавшись циклом for или while.
xx
xxxx
xxxxxx
xxxxxxxx
xxxxxxxxxx
//*/
//for ($i=1;$i<6;$i++){
//    for($y=0;$y<$i*2;$y++){
//        echo "x";
//    };
//    echo "<br>";
//};

//-------------------------------------------------------------------------------------------------------------------------------

/*
22. (+1) Создайте массив, заполните его случайными значениями (можно использовать функцию rand, например $var  = rand(5, 15)), найдите максимальное и минимальное значение массива и поменяйте их местами. */
//
//$var =[];
//for($i=0;$i<=10;$i++){
//$var[$i] = rand(5,1000);};
//
//print_r($var);
//foreach($var as $key=>$value){
//    $max=max($var);
//    $min=min($var);
//$key_min=array_search($min,$var);
//    $key_max=array_search($max,$var);
//
//$var[$key_min]=$max;
//    $var[$key_max]=$min;
//
//}
//echo "<br>";
//echo "<br>";
//echo 'MAX  '.$max."[$key_max]"."<br>";
//echo 'MIN  '.$min."[$key_min]"."<br>";
//echo "<br>";
//print_r($var);

// Измененно так как нельзя пользовать стандартные функции.


//
//$var =[];
//for($i=0;$i<=10;$i++){
//$var[$i] = rand(5,1000);};
//
//
//
//$count=count($var);
//
//
//    $max=$min=0;
//    $key_max=$key_min=0;
//
//  for ($i=0;$i<$count;$i++)
//{
//
//    if($var[$i] > $max){$key_max=$i;
//                        $max=$var[$i];
//                       }
//    else{$key_min=$i;
//         $min=$var[$i];
//        }
//
//}
//
//$var[$key_max]=$max;
//    $var[$key_min]=$min;
//
//echo "<br>";
//echo "<br>";
//echo 'MAX  '.$max."[$key_max]"."<br>";
//echo 'MIN  '.$min."[$key_min]"."<br>";
//echo "<br>";
//print_r($var);


//---------------------------------------------------------------------------------------------------
/*
23. (+1) Создайте массив и заполните его случайными числами от 1 до 100 (rand).

Выведите на экран элементы, значения которых больше нуля и у которых не парный индекс.

Также вычислите произведение тех элементов, значения которых больше нуля и у которых парные индексы

(парное число - это число, кратное 2), результат выведите на экран.
*/

//Исправленно

//$arr=array();
//for($i=1;$i<=15;$i++){
//  $arr[$i]=rand(1,100);
//};
//
//foreach($arr as $key=>$value){
//  if ($value>0 && $key%2){echo "<div style=\"position:absolute; left: 600px; \">"."НЕ ПАРНЫЙ индекс [$key] |".$key=$value."<br>"."</div>";}
//
//    if ($value>0 && $key%2==false){echo "<div style=\"margin:0,10,0,0 left: 60px; \">"."парные индексы [$key] | ".$key=$value*$value."<br>"."</div>";}
//};
////
//echo "<br>";
//echo "<br>";
//echo "<br>";
//print_r($arr);


//-------------------------------------------------------------------------------------------------

/*24. (+1) Дана строка ‘123456789’. С помощью цикла и дополнительной переменной разверните строку так, чтобы в итоге получилось ‘987654321’. Результат выводить после окончания цикла, но не внутри.*/


// Поправленно.

//$str='123456789';
//    echo $str;
//#echo"<br>";
//#    echo strrev($str);
//#echo"<br>";
//
//$var='';
//$l=strlen($str)-1;
//for($i=$l;$i>=0;$i--) // Пришлось указать что $i-1 что бы он и 0 включил в цикл.
//{
//   $var .= $str{$i};
//
//    };
//echo "<br>";
//var_dump($var);
//-------------------------------------------------------------------------------------------------


?>










